<!DOCTYPE html>
<html lang="es">

<head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta name="description" content="Material de estudio sobre etiquetas HTML">

    <title>Etiquetas B&aacute;sicas de HTML, atributos y valores</title>
    <link href="https://cdn.jsdelivr.net/npm/bootstrap@5.0.0-beta3/dist/css/bootstrap.min.css" rel="stylesheet"
        integrity="sha384-eOJMYsd53ii+scO/bJGFsiCZc+5NDVN2yr8+0RDqr0Ql0h+rP48ckxlpbzKgwra6" crossorigin="anonymous">
    <link rel="stylesheet" href="../css/styles.css">
</head>

<body class="text-light bg-dark">
    <h1>HTML</h1>
    <p>Son la siglas de <strong>hypertext markup language</strong>, es el lenguaje para construcci&oacute;n de
        p&aacute;ginas web. Es la principal tecnolog&iacute;a del universo WWW: Worl Wide Web.</p>
    <p>Actualmente se encuentra en la versi&oacute;n 5 que adiciona elementos, atributos y comportamientos. Ter&aacute;n
        (2016)</p>
    <h2>Etiquetas</h2>
    <p>Este lenguaje utiliza el concepto de etiquetas (marcas o tags) para la definici&oacute;n de elementos visuales,
        estas siguen la estructura:</p>
    <code>
        <p>&lt;inicio_etiqueta&gt;</p>
        <p style="padding-left: 40px;">contenido</p>
        <p>&lt;/fin_etiqueta&gt;</p>
    </code>
    <p>Estas etiquetas son interpretadas por los navegadores para la presentaci&oacute;n de la p&aacute;gina al usuario;
        existen unas etiquets indispensables que deben estar presentes en todos los documentos HTML pues definen su
        estructura b&aacute;sica, estas son:</p>
    <code>
        <p>&lt;html&gt;</p>
        <p style="padding-left: 40px;">
            &lt;head&gt;<br>
            &lt;/head&gt; <br>
            &lt;body&gt;
            <br>&lt;/body&gt;
        </p>
        <p>&lt;/html&gt;</p>
    </code>
    <p>La etiqueta html es la parte fundamental dentro del c&oacute;digo de una p&aacute;gina web, W3SCHOOLS (2021);
        dentro de ella se
        tienen dos etiquetas adicionales:</p>
    <ul>
        <li><strong>head</strong>: es utilizada como contenedor para metadatos (datos sobre los datos de la
            p&aacute;gina). Dentro de
            esta etiqueta se puede definir el t&iacute;tulo de la p&aacute;gina, el conjunto de caracteres, estilos,
            scripts y elementos utilizados para indexaci&oacute;n por navegadores. W3SCHOOLS (2021)</li>
        <li><strong>body</strong>: Es la etiqueta que define el cuerpo del documento, contiene todos los elementos
            definidos por el
            desarrollador para su presentaci&oacute;n al usuario, por ejemplo: p&aacute;rrafos, t&iacute;tulos,
            im&aacute;genes, tablas, enlaces, listas, etc. W3SCHOOLS (2021)</li>
    </ul>

    <p>El presente c&oacute;digo define un t&iacute;tulo y un parrafo de ejemplo.&nbsp;</p>
    <code>
    <p>&lt;html&gt;<br />&lt;head&gt;<br />&lt;/head&gt;<br />&lt;body&gt;<br />&lt;h1&gt;T&iacute;tulo de
        ejemplo&lt;/h1&gt;</p>
    <p>&lt;p&gt;Parrafo de ejemplo: Vitae lectus habitasse non phasellus mi pharetra vestibulum augue suscipit, class
        magna nullam sed hac donec semper quis, feugiat proin parturient posuere in sociosqu nulla sodales. In inceptos
        iaculis fermentum curae sem dui mauris vehicula tristique cum, potenti senectus risus egestas quam dis eu
        faucibus sociosqu eleifend gravida, congue malesuada placerat ac ultricies pellentesque lectus porttitor odio.
        Arcu eros etiam aptent per rutrum rhoncus sapien tortor dui ac, mollis duis dignissim turpis nulla sociosqu
        inceptos integer molestie, penatibus nisi aliquet mauris sagittis montes imperdiet neque
        blandit.&lt;/p&gt;<br />&lt;/body&gt;<br />&lt;/html&gt;</p>
    </code>
    <p>El resultado de ese c&oacute;digo en el navegador se presenta a continuaci&oacute;n:</p>
    <p><img src="../img/ejemplo_html.png" alt="Ejemplo de c&oacute;digo ejecutado en el navegador" /></p>


    <h2>Referencias bibliogr&aacute;ficas</h2>
    <p class="referencia_bibliografica">
        Ter&aacute;n Anciano, J. (2016). Manual de Introducci&oacute;n al lenguaje HTML. Formaci&oacute;n para el
        Empleo. Editorial CEP, S.L. Recuperado de <a
            href="https://elibro-net.bibliotecavirtual.unad.edu.co/es/ereader/unad/50964?page=134">https://elibro-net.bibliotecavirtual.unad.edu.co/es/ereader/unad/50964?page=134</a>
    </p>
    <p class="referencia_bibliografica">
        <a href="https://www.w3schools.com/tags/tag_head.asp">HTML head tag (w3schools.com)</a>
    </p>
    <p class="referencia_bibliografica">
        W3SCHOOLS, (2021). HTML &lt;body&gt; Tag. Recuperado de <a
            href="https://www.w3schools.com/tags/tag_body.asp">https://www.w3schools.com/tags/tag_body.asp</a>
    </p>
    <p class="referencia_bibliografica">
        W3SCHOOLS, (2021). HTML &lt;head&gt; Tag. Recuperado de <a
            href="https://www.w3schools.com/tags/tag_head.asp">https://www.w3schools.com/tags/tag_head.asp</a>
    </p>
    <p class="referencia_bibliografica">
        W3SCHOOLS, (2021). HTML &lt;html&gt; Tag. Recuperado de <a
            href="https://www.w3schools.com/tags/tag_html.asp">https://www.w3schools.com/tags/tag_html.asp</a>
    </p>


</body>

</html>